Revit 2027 API
Viewport.IsViewIdValidForViewport Method
 Verifies that the Viewport can change it's view id to the input %viewId%.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsViewIdValidForViewport(
	ElementId viewId
)
Public Function IsViewIdValidForViewport (
	viewId As ElementId
) As Boolean
public:
bool IsViewIdValidForViewport(
	ElementId^ viewId
)
member IsViewIdValidForViewport :
        viewId : ElementId -> bool
Parameters
viewId ElementId
 The view which will be checked to see if it can be applied to Viewport.
Return Value
Boolean
 True if the %viewId% is valid for the viewport, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace